In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                'key2': ['one', 'two', 'one', 'two', 'one'],
                'data1': np.random.randn(5),
                'data2': np.random.randn(5)})
df

      data1     data2 key1 key2
0 -0.170267  0.307925    a  one
1  0.355786 -0.974269    a  two
2 -1.050976  0.846878    b  one
3  0.316794 -1.442699    b  two
4 -0.005534 -0.026978    a  one

In [3]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    0.059995
b   -0.367091
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.087901
      two     0.355786
b     one    -1.050976
      two     0.316794
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a    -0.087901  0.355786
b    -1.050976  0.316794

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.355786
            2006   -1.050976
Ohio        2005    0.073263
            2006   -0.005534
Name: data1, dtype: float64

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.059995 -0.231108
b    -0.367091 -0.297911

In [9]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.087901  0.140473
     two   0.355786 -0.974269
b    one  -1.050976  0.846878
     two   0.316794 -1.442699

In [10]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [11]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.170267  0.307925    a  one
1  0.355786 -0.974269    a  two
4 -0.005534 -0.026978    a  one
b
      data1     data2 key1 key2
2 -1.050976  0.846878    b  one
3  0.316794 -1.442699    b  two

In [12]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.170267  0.307925    a  one
4 -0.005534 -0.026978    a  one
a two
      data1     data2 key1 key2
1  0.355786 -0.974269    a  two
b one
      data1     data2 key1 key2
2 -1.050976  0.846878    b  one
b two
      data1     data2 key1 key2
3  0.316794 -1.442699    b  two

In [13]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2 -1.050976  0.846878    b  one
3  0.316794 -1.442699    b  two

In [14]:
people = DataFrame(np.random.randn(5, 5),
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Traivs'])
people.loc[2:3, ['b', 'c']] = np.nan

In [15]:
people

               a         b         c         d         e
Joe     0.845027  1.367783  0.755842  1.530024 -0.473874
Steve   0.156627  0.613838  0.542508  1.853584  2.446089
Wes    -0.363466       NaN       NaN  1.117111 -1.606998
Jim     1.636744  0.400108  1.115693  1.438342  0.172096
Traivs -1.754881  0.216121  0.767864  0.110991  1.070638

In [16]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     2.285866  1.738936
Steve   2.396091  3.216555
Wes     1.117111 -1.970464
Jim     2.554035  2.208948
Traivs  0.878855 -0.468122

In [17]:
map_series = Series(mapping)
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Traivs     2    3

In [18]:
people.groupby(len).sum()

          a         b         c         d         e
3  2.118305  1.767890  1.871535  4.085477 -1.908776
5  0.156627  0.613838  0.542508  1.853584  2.446089
6 -1.754881  0.216121  0.767864  0.110991  1.070638

In [19]:
df

      data1     data2 key1 key2
0 -0.170267  0.307925    a  one
1  0.355786 -0.974269    a  two
2 -1.050976  0.846878    b  one
3  0.316794 -1.442699    b  two
4 -0.005534 -0.026978    a  one

In [20]:
grouped = df.groupby('key1')
grouped

In [21]:
grouped['data1'].quantile(0.9)

key1
a    0.283522
b    0.180017
Name: data1, dtype: float64

In [22]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.526053  1.282194
b     1.367769  2.289577

In [23]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.059995  0.269079 -0.170267 -0.087901 -0.005534  0.175126
b      2.0 -0.367091  0.967159 -1.050976 -0.709033 -0.367091 -0.025148

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.355786   3.0 -0.231108  0.665024 -0.974269 -0.500624 -0.026978
b     0.316794   2.0 -0.297911  1.618975 -1.442699 -0.870305 -0.297911


           75%       max
key1
a     0.140473  0.307925
b     0.274484  0.846878

In [24]:
tips = pd.read_csv('tips.csv')

In [25]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [26]:
grouped = tips.groupby(['sex', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [27]:
grouped_pct.agg(['mean','std', peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [28]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [29]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [30]:
grouped.agg({'tip': 'max', 'size': 'sum'})

               size   tip
sex    smoker
Female No       140   5.2
       Yes       74   6.5
Male   No       263   9.0
       Yes      150  10.0

In [31]:
grouped.agg({'tip_pct': ['min', 'max', 'mean', 'std'], 'size': 'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

In [32]:
df

      data1     data2 key1 key2
0 -0.170267  0.307925    a  one
1  0.355786 -0.974269    a  two
2 -1.050976  0.846878    b  one
3  0.316794 -1.442699    b  two
4 -0.005534 -0.026978    a  one

In [33]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')
k1_means

      mean_data1  mean_data2
key1
a       0.059995   -0.231108
b      -0.367091   -0.297911

In [35]:
pd.merge(df, k1_means, left_on='key1', right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0 -0.170267  0.307925    a  one    0.059995   -0.231108
1  0.355786 -0.974269    a  two    0.059995   -0.231108
4 -0.005534 -0.026978    a  one    0.059995   -0.231108
2 -1.050976  0.846878    b  one   -0.367091   -0.297911
3  0.316794 -1.442699    b  two   -0.367091   -0.297911

In [36]:
people

               a         b         c         d         e
Joe     0.845027  1.367783  0.755842  1.530024 -0.473874
Steve   0.156627  0.613838  0.542508  1.853584  2.446089
Wes    -0.363466       NaN       NaN  1.117111 -1.606998
Jim     1.636744  0.400108  1.115693  1.438342  0.172096
Traivs -1.754881  0.216121  0.767864  0.110991  1.070638

In [38]:
key = ['one', 'two', 'one', 'two', 'one']
people.groupby(key).mean()

            a         b         c         d         e
one -0.424440  0.791952  0.761853  0.919375 -0.336745
two  0.896686  0.506973  0.829100  1.645963  1.309093

In [39]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.424440  0.791952  0.761853  0.919375 -0.336745
Steve   0.896686  0.506973  0.829100  1.645963  1.309093
Wes    -0.424440  0.791952  0.761853  0.919375 -0.336745
Jim     0.896686  0.506973  0.829100  1.645963  1.309093
Traivs -0.424440  0.791952  0.761853  0.919375 -0.336745

In [40]:
def demean(arr):
    return arr - arr.mean()

people.groupby(key).transform(demean)

               a         b         c         d         e
Joe     1.269467  0.575831 -0.006011  0.610648 -0.137129
Steve  -0.740058  0.106865 -0.286593  0.207621  1.136997
Wes     0.060974       NaN       NaN  0.197736 -1.270253
Jim     0.740058 -0.106865  0.286593 -0.207621 -1.136997
Traivs -1.330441 -0.575831  0.006011 -0.808384  1.407383

In [41]:
demeaned = people.groupby(key).transform(demean)

In [42]:
demeaned.groupby(key).mean()

                a             b             c             d             e
one  0.000000e+00  0.000000e+00 -5.551115e-17  7.401487e-17  0.000000e+00
two  5.551115e-17  2.775558e-17  0.000000e+00  0.000000e+00 -1.110223e-16

In [44]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

top(tips, n=6)

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [45]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [46]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [47]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [48]:
result.unstack('smker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [50]:
f = lambda x: x.describe()
grouped.apply(f)

                     total_bill        tip       size    tip_pct
sex    smoker
Female No     count   54.000000  54.000000  54.000000  54.000000
              mean    18.105185   2.773519   2.592593   0.156921
              std      7.286455   1.128425   1.073146   0.036421
              min      7.250000   1.000000   1.000000   0.056797
              25%     12.650000   2.000000   2.000000   0.139708
              50%     16.690000   2.680000   2.000000   0.149691
              75%     20.862500   3.437500   3.000000   0.181630
              max     35.830000   5.200000   6.000000   0.252672
       Yes    count   33.000000  33.000000  33.000000  33.000000
              mean    17.977879   2.931515   2.242424   0.182150
              std      9.189751   1.219916   0.613917   0.071595
              min      3.070000   1.000000   1.000000   0.056433
              25%     12.760000   2.000000   2.000000   0.152439
              50%     16.270000   2.880000   2.000000   0.173913
              75%     22.120000   3.500000   2.000000   0.198216
              max     44.300000   6.500000   4.000000   0.416667
Male   No     count   97.000000  97.000000  97.000000  97.000000
              mean    19.791237   3.113402   2.711340   0.160669
              std      8.726566   1.489559   0.989094   0.041849
              min      7.510000   1.250000   2.000000   0.071804
              25%     13.810000   2.000000   2.000000   0.131810
              50%     18.240000   2.740000   2.000000   0.157604
              75%     22.820000   3.710000   3.000000   0.186220
              max     48.330000   9.000000   6.000000   0.291990
       Yes    count   60.000000  60.000000  60.000000  60.000000
              mean    22.284500   3.051167   2.500000   0.152771
              std      9.911845   1.500120   0.892530   0.090588
              min      7.250000   1.000000   1.000000   0.035638
              25%     15.272500   2.000000   2.000000   0.101845
              50%     20.390000   3.000000   2.000000   0.141015
              75%     28.572500   3.820000   3.000000   0.191697
              max     50.810000  10.000000   5.000000   0.710345

In [52]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [53]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [54]:
frame = DataFrame({'data1': np.random.randn(1000),
                   'data2': np.random.randn(1000)})
factor = pd.cut(frame.data1, 4)

In [57]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

grouped=frame.data2.groupby(factor)
grouped

In [58]:
grouped.apply(get_stats)

data1
(-3.482, -1.701]  count     59.000000
                  max        1.967648
                  mean      -0.066288
                  min       -2.351990
(-1.701, 0.0721]  count    475.000000
                  max        3.644801
                  mean       0.033134
                  min       -3.544397
(0.0721, 1.846]   count    439.000000
                  max        2.888544
                  mean       0.094257
                  min       -3.028086
(1.846, 3.619]    count     27.000000
                  max        1.979250
                  mean       0.195505
                  min       -1.708622
Name: data2, dtype: float64

In [59]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.482, -1.701]   59.0  1.967648 -0.066288 -2.351990
(-1.701, 0.0721]  475.0  3.644801  0.033134 -3.544397
(0.0721, 1.846]   439.0  2.888544  0.094257 -3.028086
(1.846, 3.619]     27.0  1.979250  0.195505 -1.708622

In [60]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  1.967648 -0.038579 -2.351990
1      100.0  2.773153  0.044352 -1.990012
2      100.0  2.615974  0.140832 -3.544397
3      100.0  3.644801 -0.075784 -2.814757
4      100.0  2.425444 -0.005802 -2.119118
5      100.0  2.330168  0.086322 -2.539821
6      100.0  2.435473  0.073492 -3.028086
7      100.0  2.424203  0.093035 -2.459496
8      100.0  2.888544  0.093917 -2.604976
9      100.0  2.719232  0.173065 -3.006839

In [61]:
s = Series(np.random.randn(6))
s[::2] = np.nan

In [62]:
s

0         NaN
1    0.805597
2         NaN
3   -0.711391
4         NaN
5   -0.540869
dtype: float64

In [64]:
s.fillna(s.mean())

0   -0.148888
1    0.805597
2   -0.148888
3   -0.711391
4   -0.148888
5   -0.540869
dtype: float64

In [67]:
states = ['Ohio', 'New York', 'Vermont', 'Floria',
          'Oregon', 'Nevada', 'Clifornia', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = Series(np.random.randn(8), index=states)
data

Ohio         0.157961
New York     0.248427
Vermont      1.638329
Floria       0.650316
Oregon      -0.270738
Nevada       0.803722
Clifornia    0.303460
Idaho       -0.139860
dtype: float64

In [68]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         0.157961
New York     0.248427
Vermont           NaN
Floria       0.650316
Oregon      -0.270738
Nevada            NaN
Clifornia    0.303460
Idaho             NaN
dtype: float64

In [69]:
data.groupby(group_key).mean()

East    0.352235
West    0.016361
dtype: float64

In [73]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio         0.157961
New York     0.248427
Vermont      0.352235
Floria       0.650316
Oregon      -0.270738
Nevada       0.016361
Clifornia    0.303460
Idaho        0.016361
dtype: float64

In [93]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'Q', 'K']
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)
deck = Series(card_val, index=cards)

In [94]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])

draw(deck)

QC    10
9C     9
3D     3
JH    10
4D     4
dtype: int64

In [95]:
draw(deck)

AD     1
AH     1
7D     7
JC    10
JS    10
dtype: int64